{"category":"Autos","view_count":"16335","video_description":"Carjam Car Radio Show -- A Car Show About People\nWebsite:   http:\/\/www.kclr96fm.com\/presenters?id=531\nTwitter:    http:\/\/www.twitter.com\/carjamradio\nYoutube: http:\/\/www.youtube.com\/user\/CarjamRadio\n\nThe second generation of Bentley's iconic Continental GTC convertible will debut at next month's International Automobile Exhibition (IAA) in Frankfurt.\n\nTaking cues from its GT coupe sibling launched last year, the new Continental GTC builds on the highly successful foundation of the previous cabriolet, which premiered in 2006. Bentley's design and engineering teams have improved virtually every aspect of the iconic convertible with an uncompromising focus on quality.\n\nWhile the first Continental GTC was elegant and understated, the sharper radii and assertive stance of the new model delivers a more contemporary and muscular presence. Advanced manufacturing techniques produce aluminium front wings without the need for seams or welds creating the look and feel of a coach-built car. Twenty-inch wheels are now standard with three styles of 21-inch wheel, a first for GTC, available as an option, reinforcing the distinctive, sporting stance of the new Bentley.\n\nThe four-seater luxury convertible features a new, even more spacious and sumptuous hand-crafted cabin, with soft-touch leather hides, an extensive range of wood veneers, cool-touch metals and deep-pile carpets. There are 17 standard soft-touch leather hide colours with six colour split combinations, complemented by a range of seven veneers, all produced by Bentley's talented craftsmen and women.\n\nThe GTC's renowned coupe-like refinement is also enhanced. The tailored, multi-layered fabric hood is complemented by acoustic glass and under-body panels, for optimum noise isolation.\n\nSuperb everyday practicality for a luxury convertible was a hallmark of the original GTC and much valued by its customers. The cabin of the new GTC is now even more practical, with additional rear legroom, new storage solutions and innovative features such as touch-screen infotainment, automatic seat-belt presenters and a Bentley-designed Neck Warmer for comfortable roof-down motoring whatever the temperature.\n\nA wider track, front and rear, sharper steering and retuned suspension provides a more exhilarating and class-leading drive. Bentley's advanced all-wheel drive system features a new 40:60 rear torque bias (compared with 50:50 of the original GTC) minimising understeer during hard cornering and allowing the spirited driver to manage the car's line and balance via precise throttle control.\n\nThis compelling dynamic package is combined with a more powerful 6.0-litre, twin-turbocharged W12 engine as well as a new QuickShift transmission enabling faster gear changes than ever before. Power output is raised from 560PS to 575PS (567bhp\/423kW) and the famed Bentley 'wave of torque' has been increased by a further 50Nm to 700Nm (516lb ft).\n\n\"The GTC has always been the most emotional model in the Continental range and a showcase for Bentley design. With its tailored soft top, the GTC is a pure British convertible true to those classic Bentleys of the past. However, the technology, performance and overall design excellence invested in this model means that we are now writing a new chapter for the Bentley convertible driver.\"\n\nWolfgang Dürheimer, Chairman and Chief Executive, Bentley Motors.\n\nThe Bentley Continental GTC is now available to order and first customer deliveries will begin in late 2011.\n\nPricing Information\nPOUNDS STERLING £149,350\nUS DOLLAR $212,800 MSRP\nEURO €170,060\nRENMINBI RMB 3,838,000\nYEN ¥26,400,000\n\n    Pounds Sterling inclusive of 20% VAT.\n    Euro price does not include individual market taxation rates.\n    US Dollar pricing is exclusive of individual state taxes.\n\n\ncarjamradio \"car jam radio\" \"car radio show\" \"car talk radio show\" \"carjam\" ferrari \"car talk\" \"bbc top gear\" \"great car ad 2011\" \"funny commercials 2011\" \"banned car commercials 2011\" f1 \"formula one\" \"classic cars\" evo \"best car ads 2011\" \"funny car ads 2011\" funniest \"fail\"  \"sexy car ad 2011\" \"road test\" \"road review\" \"car test\" \"road report\" \"driving test\" hot sexy new nissan fast Porsche suv \"celebrity car\" maserati vw audi 4x4 estate lotus fiat \"alfa romeo\" subaru toyota ford  impreza \"high speed\" \"tractor\" \"rally car\" crashes accidents","title":"Bentley Continental GTC Convertible Sexy Commercial 2011 - Carjam Car Radio Show","avg_rating":"4.769231","video_id":"foBhpQRiQ7I","video_type":"commercial","comments":[{"text":"The music in the new Bentley Continental GTC Convertible commercial ad 2011 is \"7 Heures du Matin\" by Jaqueline Taieb. Click on the \"Show More\" tab﻿ above for all the information and prices for the car! Thank you for watching Carjam Radio.","published":"2011-08-24T11:08:03.000Z","id":"G2N_9bnmJSV43ad9FLQZye3h6r0zIqrCJ7OzRs2qBFI","author":"CarjamRadio","annotation":{"video-related":"1","vrating":"2"}},{"text":"I﻿ love this channel. And im a woman, lol.","published":"2011-08-24T18:47:49.000Z","id":"G2N_9bnmJSXaq4LMv-IZNAKraDJTd5fvbQAAM_OCxvo","author":"TheRoroki","annotation":{"video-related":"1","positive-video":"1","vrating":"1"}},{"text":"Great, I'll﻿ take 2.","published":"2011-08-26T16:53:37.000Z","id":"G2N_9bnmJSVY-WO4TpluKW9ffZe5TCQuxTuBXI27BCQ","author":"Barry O'Driscoll","annotation":{"product-related":"1","positive-product":"1","rating":"1"}},{"text":"keep the change﻿ n.n","published":"2012-04-17T16:56:00.000Z","id":"G2N_9bnmJSU2xRPCDPb5wy2AGAb_hzrsO31FO2KzwkY","author":"Miguel Angel Abreu Castañeda","annotation":{"off-topic-or-undecidable":"1"}},{"text":"is it faster than a smart car?﻿","published":"2012-04-21T22:05:23.000Z","id":"G2N_9bnmJSWO--pfPQrMbUZ-NH19kS-vBReiex1enMg","author":"TheD0RKNIGHT","annotation":{"product-related":"1","rating":"1"}},{"text":"Vanadushinavore to you too﻿ :)","published":"2012-06-09T17:49:59.000Z","id":"G2N_9bnmJSXcVvpYagdS8w7u2VvnZD5kiXqNGPwm3zU","author":"AirJordan22","annotation":{"not-english":"1"}},{"text":"My future﻿ car!","published":"2012-06-26T00:19:55.000Z","id":"G2N_9bnmJSVmC-L9CFOOROeAAna0WRzWjqP0AxHXSpI","author":"simonmallory","annotation":{"product-related":"1","rating":"1"}}],"uploader":"CarjamRadio","published":"2011-08-24T10:59:15.000Z","duration":"75"}