{"category": "Tech", "view_count": "10850", "video_description": "http://www.amazon.com/gp/product/B002V3C4F8?ie=UTF8&tag=thedigdig-20&linkCode=as2&camp=1789&creative=390957&creativeASIN=B002V3C4F8After reviewing the iPad I felt it was important to show everyone an alternative device. Sadly, the A9 only partially lives up to its claim of being a fully functional tablet running Windows 7. Enjoy!", "title": "The Digital Digest Archos 9 PC Tablet Review", "avg_rating": "4.3333335", "video_id": "Be5n_PompuM", "video_type": "review", "comments": [{"text": "I have to agree, this tablet is not up to speed. However you showed nothing about what it can do. You spent most﻿ of the video complaining about the touch screen(which I agree does suck). You didn't show how it plays flash, or Skype. Would have been nice to see how some simple task would work. You talked about the Stylus but didn't show us how well it recognize handwriting. Archos should market this thing to compete with netbooks and not the iPad. Unfortunately it's price is probably too high.", "published": "2010-05-29T00:37:05.000Z", "id": "ks0_5dG6kj5kk-BfmfhWBUk9gQ-pXW_cs5YJhLHAYng", "author": "Walrondrm"}, {"text": "Exactly, where the frak is the flash test?  He keeps saying something to consider... here's something, he doesn't have any experience reviewing a tablet... and since it's 1st gen it's gonna have some issues. Archos is infamous for their bleeding-edge tech, it's not for your average given everything at birth Apple user who expects everything immediately, no, you have to understand what goes on behind the virtual machine in some cases and adapt.﻿  Too steep a learning curve for reviewer?", "published": "2010-05-31T14:38:19.000Z", "id": "ks0_5dG6kj6pNDjY3abolLJiJ2EO5jwkyHTTjvLobJI", "author": "biathcw"}, {"text": "While I understand both your and Wal's critique, there was no flash test because I didn't feel it was warranted. ﻿ I tested flash with rc5 and hd(latest GMA500 driver) playback on this device. They both were functional however the touchscreen ruins the entire experience. If you enjoy using the stylus then this product may be right for you. I was going to do a clean install of win7 on this but between dead pixels and its poor screen, it wouldn't have served a purpose for me.", "published": "2010-05-31T18:39:40.000Z", "id": "ks0_5dG6kj5kQPTlgTjNCr03NFzu8Gz9xBlctmtsQTc", "author": "TheDigitalDigest"}, {"text": "I dont think the price is too high, I just think the execution of the final product is poor. This could have been a great piece of kit, instead it seems like a half baked experiment.﻿ Really wanted to love this device but couldn't. I thought 1 year after buying my Sony P I would be able to replace it with this sort of device but the P is still the best machine in its class(no touch screen of course but same weight and size as most tablets and UMPC's).", "published": "2010-06-01T21:35:55.000Z", "id": "ks0_5dG6kj5QopBh68dqgmz_L-1Lcwu5_hvRfzOGOvQ", "author": "TheDigitalDigest"}, {"text": "Thanks for﻿ watching!", "published": "2010-06-01T21:38:18.000Z", "id": "ks0_5dG6kj5e5-G9HA-NlPQFQttilfymYMYtSDLmPZI", "author": "TheDigitalDigest"}, {"text": "The touchscreen is resistive, compared to the iPad's capactive screens. Capacitive screens are great for fingers, but not so good with precise stuff like styluses. Resistive screens are the opposite. I think this tablet would be great with a stylus. Have you tried using that? Windows 7 probably wouldn't work very well using fingers anyway since you﻿ need a precise pointing device (such as a mouse or a stylus)", "published": "2010-10-02T23:24:21.000Z", "id": "ks0_5dG6kj7mGD8QHlVSeu2AFoFGbJJHgQzgCT1fQzg", "author": "9a3eedi"}, {"text": "Can't you get updates for the bad touchscreen scroll?﻿", "published": "2010-12-29T20:17:08.000Z", "id": "ks0_5dG6kj5QPIDuP2SgS9KchmiBQIVtlq9ezV36tns", "author": "mickxi1"}, {"text": "would this be nice for something that﻿ my dad wants, to check email, keep tallies on his political offices events and stuffs, and writing stuff? its cheaper than the ipod, and quite coincidentally, more bang for its buck.", "published": "2011-01-17T03:20:31.000Z", "id": "ks0_5dG6kj48WkU1zvyW-NzkXdINAZrqsYKlRbdd2IM", "author": "aftermathmovieslite"}, {"text": "you have to tap the touch screen with somthing hard like your fingernail. \n\nIt is true﻿ this is not redy to go out of the box. you need to so some software work and normal users will not know how to do that but if your good with computers and you like resistive touch screens like me pick one up on ebay. i got mine for $300 with a case and the port replicator (lets just say the price was right)\n\non an off note the screen is great for drawing with \"ArtRage\" work better that the ipad app of it.", "published": "2011-04-04T08:16:48.000Z", "id": "ks0_5dG6kj4hrsEfKCZXWSiu_tWopc0wy6ifVFgjCcU", "author": "cloudenvy000"}, {"text": "holey captain crud mine said \"this copy of windows is not genuine\" i thought id done something﻿ to it ... plus geting a replacment touch screen fitted soon.. aparently archos only outsources its screen repair so its upto you to find a repair depo...", "published": "2011-06-22T10:43:42.000Z", "id": "ks0_5dG6kj4cqejwNbo87VioiUOwIUfB-DihAeYww18", "author": "MCSnotty1b"}, {"text": "I have this tablet on 7﻿ months, The worst thing about its the Touchscreen mine has too many scratches and the replacement screen costs $80, it goes like unsensitive every month, and the accesories are expensive, BUT I bought mine by $300", "published": "2012-01-11T06:39:14.000Z", "id": "ks0_5dG6kj7ZMeR3dStk-uUXnCrsVRsXiUn9vEqrfYA", "author": "aullaralaluna"}, {"text": "only addons from \"Chrome Touch\" and \"Mozilla Grab and﻿ Drag\"", "published": "2012-01-11T06:46:21.000Z", "id": "ks0_5dG6kj6rJPOcuorCZ3t-x4A5yBMCe3Qr0i9r04E", "author": "aullaralaluna"}, {"text": "Its not a﻿ hard drive, its a ssd", "published": "2012-03-25T10:18:36.000Z", "id": "ks0_5dG6kj53XjtB_RgZg-QBMqoOzAdBJsCkeh4Oif8", "author": "gabouls1234"}, {"text": "you should hold a galaxy﻿ tab 10.1 and then you will know what weak and creaky means", "published": "2012-09-25T16:38:40.000Z", "id": "ks0_5dG6kj556uKB5RI4zVuNUKLgBG4kgFp8VlGGj-I", "author": "rob07tg"}], "uploader": "TheDigitalDigest", "published": "2010-05-27T07:00:15.000Z", "duration": "455"}